{
    "README": "Warnings in this file map warning codes to short messages and extended help messages. Anything in the optional 'tex' nested object will override the values in the parent object if the document source is a LaTeX file instead of a DOCX file.",
    "warnings": {
        "unexpected": {
            "message": "An unanticipated error occurred that may require improvements to the document parser used in conversion; please notify support",
            "help": "pnb@illinois.edu"
        },
        "make4ht_failed": {
            "message": "LaTeX compilation errors; see full output (line numbers will match your source file unless you used \\input{})",
            "help": "If the document compiles on your own computer (or Overleaf, etc.), this error might be caused by using unsupported packages or a different build system. Modeling your paper closely to the template may help. In some cases the document can be converted anyway."
        },
        "style_paper_title": {
            "message": "Did not find \"Paper-Title\" style",
            "help": "Select the text of your paper title in Word, open the Styles pane, and make sure that the \"Paper-Title\" style is used.",
            "tex": {
                "message": "Could not parse paper title",
                "help": "This error is unlikely to occur and may indicate a large problem. Check that the \\maketitle command was used in LaTeX, and that the template is correct."
            }
        },
        "style_abstract_heading": {
            "message": "Could not find abstract heading",
            "help": "Select the text of the \"Abstract\" heading in Word, open the Styles pane, and make sure that the \"Abstract Heading\" style is used.",
            "tex": {
                "help": "Check that the paper has an abstract defined with the \\begin{abstract} and \\end{abstract} environment, as shown in the template."
            }
        },
        "style_keywords_heading": {
            "message": "Could not find keywords heading",
            "help": "Make sure the paper has a \"Keywords\" heading, as shown in the template. Select the text of the \"Keywords\" heading in Word, open the Styles pane, and make sure the \"Keywords Heading\" style is used.",
            "tex": {
                "help": "Make sure the paper has keywords defined with the \\keywords{} command, as shown in the template."
            }
        },
        "style_keywords": {
            "message": "Could not find keywords",
            "help": "Select the text of the keywords section in your paper in Word, open the Styles pane, and make sure the \"Keywords\" style is used.",
            "tex": {
                "help": "Make sure the paper has keywords defined with the \\keywords{} command, as shown in the template."
            }
        },
        "style_author": {
            "message": "Could not find any authors",
            "help": "Select the text of the first author's name, open the Styles pane, and make sure the \"Author\" style is used. Repeat for each author.",
            "tex": {
                "help": "Make sure authors are defined as shown in the template."
            }
        },
        "style_affiliations": {
            "message": "Could not find any affiliations",
            "help": "Select the text of the first author's affiliation, open the Styles pane, and make sure the \"Affiliations\" style is used. Repeat for each author.",
            "tex": {
                "help": "Make sure author affiliations are defined with the \\affaddr command as shown in the template."
            }
        },
        "style_email": {
            "message": "Could not find any e-mail addresses",
            "help": "Select the text of the first author's e-mail address, open the Styles pane, and make sure the \"E-Mail\" style is used. Repeat for each author.",
            "tex": {
                "help": "Make sure author e-mail addresses are defined with the \\email command as shown in the template."
            }
        },
        "style_email_in_author": {
            "message": "Author name contains \"@\" symbol",
            "help": "Text marked with the \"Author\" style contained an \"@\" symbol, suggesting it might contain an email address. Select each email address, open the Styles pane, and make sure it has the \"E-Mail\" style rather than \"Author\" style. Note that if you may need to add a paragraph break (i.e., press Enter) after each email address; otherwise, Word might force each email address to have the same style as the subsequent author's name does (in which case one of them will have the wrong style)."
        },
        "style_space_in_email": {
            "message": "Email address contains a space",
            "help": "Text marked with the \"E-Mail\" style contained a space, suggesting it might include some other text, such as author names. Open the Styles pane, select each part of the author info, make sure each part has the correct style. Note that if you may need to add a paragraph break (i.e., press Enter) after each email address; otherwise, Word might force each email address to have the same style as the subsequent author's name does (in which case one of them will have the wrong style). If this warning occurs because you are using some custom formatting of emails (e.g., \"[person1, person2] @ domain.com\") you may ignore it.",
            "tex": {
                "help": "Check to make sure the \\email command is used for email addresses only. If this warning occurs because you are using some custom formatting of emails (e.g., \"[person1, person2] @ domain.com\") you may ignore it."
            }
        },
        "style_no_intro": {
            "message": "No \"Introduction\" section found",
            "help": "If you intended not to have an introduction section, ignore this message. Otherwise, select your Introduction header in Word, open the Styles pane, and make sure the \"Heading 1\" style is used.",
            "tex": {
                "help": "If you intended not to have an introduction section, ignore this message. Otherwise, make sure you used the \\section{Introduction} command in your paper."
            }
        },
        "style_no_refs": {
            "message": "No \"References\" section found",
            "help": "Click on your References header in Word, open the Styles pane, and make sure the \"Heading 1\" style is used.",
            "tex": {
                "help": "Make sure you used the \\bibliographystyle{abbrv} and \\bibliography{sigproc} (or whatever your .bib file is named instead of sigproc.bib) commands in your paper."
            }
        },
        "no_references_found_in_reference_section": {
            "message": "No reference section with references found",
            "help": "Check that your reference section is called 'REFERENCES' and uses the correct style.",
            "tex": {
                "help": "Make sure you used the appropriate section command and bibtex style."
            }
        },
        "no_citations_found_in_text": {
            "message": "No citations found in the text",
            "help": "Check that your in-text citations use the correct numbered style, e.g. [1].",
            "tex": {
                "help": "Make sure you used the appropriate \\cite command and square brackets citation style."
            }
        },
        
        "mismatched_refs": {
            "message": "Mismatched references",
            "help": "The in-text citation numbers do not match your numbered references, indicating that there might be unused references in your References section, or citations to missing references. Make sure you are using square brackets citation style if you are not already. Sometimes this message may be incorrect; for example, if a range in an equation (e.g., [1, 100]) is mistaken for a reference.",
            "tex": {
                "help": "Make sure you used the appropriate \\cite command and square brackets citation style. Sometimes this message may be incorrect; for example, if a range in an equation (e.g., [1, 100]) is mistaken for a reference."
            }
        },
        "incomplete_reference": {
            "message": "An entry in the reference section might be incomplete",
            "help": "Find the numbered entry in your reference section and check for the missing elements. If we did not correctly recognize the entry's type, the warning may be invalid, but please double check these anyway.",
            "tex": {
                "help": "Check that the missing elements are in your Bibtex. If you see them but they don't appear in the PDF, you may have them in the wrong Bibtex field."
            }
        },
        "alt_text_missing": {
            "message": "Missing alt text for image",
            "help": "Follow the instructions in the template for adding alt text to images. Every image needs alt text to ensure the paper can be understood by people using screen reader software. Additionally, alt text is used by the HTML conversion program to identify each image, so alt text must be unique for each image; things like image sizes may be wrong otherwise.",
            "tex": {
                "help": "Use the \\Description{} command, as shown in the template, to add alt text. Every image needs alt text to ensure the paper can be understood by people using screen reader software."
            }
        },
        "alt_text_long": {
            "message": "Alt text may be too long (over 150 characters)",
            "help": "Alt text should be 150 characters or less to provide the best experience to people using screen reader software, since some screen readers may stop reading the text at that point."
        },
        "tex_file_missing": {
            "message": "No .tex files found in root of .zip file; cannot process",
            "help": "The most likely cause of this problem is if your LaTeX source file is in a folder inside the .zip file. To fix this, create a .zip file by selecting all the files in your project and compressing them, rather than compressing the containing folder."
        },
        "ambiguous_tex_file": {
            "message": "Multiple .tex files found and none named \"main.tex\"; unclear which to use",
            "help": "The converter will use the lexicographically first .tex file in your .zip file if it is unclear which to use. If that is not the correct file, fix this by renaming the primary file to compile to \"main.tex\"."
        },
        "author_data_missing": {
            "message": "Could not find author metadata section",
            "help": "Make sure to specify author information, include names, affiliations, and e-mail addresses, as shown in the template."
        },
        "table_caption_missing": {
            "message": "No table caption starting with \"Table\" found",
            "help": "Select the text of each of your table captions in Word, open the Styles pane, and make sure the \"Caption\" style is selected.\nNote that \"table index\" refers to counting tables in the order they seem to appear in the document source, which may not be exactly the same order they are laid out on the page. Check all table captions to be on the safe side."
        },
        "table_header_missing": {
            "message": "No table header row(s) found",
            "help": "Select the cells of the header row(s) in each of your tables, right click, and click on \"Table Properties\". Then check the box \"Repeat as header row at the top of each page\", which will mark the row as a header (regardless of whether the table spans multiple pages).\nNote that \"table index\" refers to counting tables in the order they seem to appear in the document source, which may not be exactly the same order they are laid out on the page. Check all table headers to be on the safe side."
        },
        "table_styles_missing": {
            "message": "Possible missing \"Table Header\" or \"Table Text\" styles",
            "help": "First check the header row(s) of your tables by selecting the header cells, opening the Styles pane, and verifying that the \"Table Header\" style is used. Then repeat for the content cells of your tables, checking for the \"Table Text\" style.\nThis warning may occasionally occur even if the correct styles are applied, if the contents of the table are more complicated than typical text; if so, ignore this warning unless the converted document looks incorrect.\nNote that \"table index\" refers to counting tables in the order they seem to appear in the document source, which may not be exactly the same order they are laid out on the page. Check all tables to be on the safe side."
        },
        "wmf_images": {
            "message": "Document contains WMF images, which are not fully supported",
            "help": "Size and alt text will have to be manually added after conversion. Please notify support."
        },
        "unknown_image_type": {
            "message": "Unexpected image format",
            "help": "The image may have to be converted to a web-compatible format after document conversion. Please notify support."
        },
        "unknown_caption_type": {
            "message": "Unknown caption type",
            "help": "This warning occurs if the parser could not determine whether a caption belonged to a table or figure based on the text of the caption. Figure captions should start with \"Figure X\" or \"Fig. X\", while table captions should start with \"Table X\". Using the Insert Caption functionality in Word when creating captions should ensure this is the case."
        },
        "table_caption_in_table": {
            "message": "Table caption inside table row",
            "help": "Table captions should be separate from the table, not in the table itself. Though it may look the same visually in the original document, semantically it does not make sense for the caption to be treated as tabular data. Hence, it will be odd for someone reading the paper using a screenreader, or when converted to HTML with slightly different visual styles applied."
        },
        "table_caption_distance": {
            "message": "Table not found immediately below caption",
            "help": "Table captions should appear directly above tables with nothing between them and the table.",
            "tex": {
                "help": "The \\caption command should appear before your table content so that the caption is above the table. Check the template to see an example."
            }
        },
        "figure_caption_distance": {
            "message": "Figure not found immediately before caption",
            "help": "Figure captions should appear directly below figure images with nothing between them and the figure image."
        },
        "figure_caption_unstyled": {
            "message": "Figure caption may be missing style",
            "help": "Figure captions should have the \"Caption\" style, as shown in the template. Given that one of the images in the document was immediately followed by \"Figure...\" text, it seems like it may have been intended to be a caption. Using the \"Caption\" style is essential to denote where the caption starts and ends, and whether the image is a figure or an image with some other purpose."
        },
        "figure_caption_blank": {
            "message": "Blank figure caption",
            "help": "This often happens if something that is not a caption has the \"Caption\" style, such as a blank paragraph (newline) or an image. The message above should show approximately where in the document it occurred. One way to find these cases is to open the Styles pane in Word, click on the down arrow by the \"Caption\" style, and click \"Select All\". After selecting the part that should not be a caption, set the appropriate style (\"Normal\" is often a good choice). This warning is often accompanied by an unknown caption type warning, which might be fixed by fixing this."
        },
        "chart_caption_not_found": {
            "message": "Chart caption not found",
            "help": "A \"chart\" is a DrawingML object, such as a graph pasted in from Excel. This warning indicates that the caption could not be found for a chart. Chart captions are just like figure captions, and should start with \"Figure X\" or \"Fig. X\". Chart parsing can be finicky, so please contact support if you believe this warning is incorrect."
        },
        "chart_caption_distance": {
            "message": "Chart caption not found immediately after chart",
            "help": "A \"chart\" is a DrawingML object, such as a graph pasted in from Excel. The chart caption should appear directly below the chart with nothing between the caption and chart. Chart captions are just like figure captions, and should start with \"Figure X\" or \"Fig. X\". Chart parsing can be finicky, so please contact support if you believe this warning is incorrect."
        },
        "tex_env_parse_fail": {
            "message": "LaTeX environment parsing error",
            "help": "The LaTeX parser was unable to find the environment containing a specific line. This indicates a possible mismatch in \\begin{} and \\end{} statements in your LaTeX source, or a possible bug in the parser (in which case please contact support)."
        },
        "no_newline_after_algorithmic": {
            "message": "Blank line suggested",
            "help": "It is occasionally helpful to add a blank line after the \\end{algorithmic} command. For example, the LaTeX HTML compiler will sometimes render inline math as block equations (each on its own line) if this blank line is missing. If the result looks OK, you may safely ignore this message."
        }
    }
}
